/////////////////////////////////////////////////////
//
// 더미클라이언트 Config
//
/////////////////////////////////////////////////////

:LOGIN_SERVER
{
//	IP = "192.168.10.10"
//	PORT = 30000
	IP = "127.0.0.1"
	PORT = 6000
}


// 미사용
:CHAT_SERVER
{
//	IP = "192.168.10.106"
//	PORT = 12101

	IP = "127.0.0.1"
	PORT = 12001

//	IP = "106.245.38.107"
//	PORT = 12060
}


:DUMMY_CLIENT
{
	//-------------------------------------------------
	// 접속트래픽 설정
	//
	// 총 접속자 수는 THREAD_NUMBER * CONNECT_CLIENT 
	//-------------------------------------------------
	THREAD_NUMBER	= 50	// 스레드 개수		최대 100
	CONNECT_CLIENT	= 50	// 스레드 당 클라이언트 수	최대 50




	//-------------------------------------------------
	// 권장 설정 수치
	//-------------------------------------------------
//	RAND_DISCONNECT	= 30   // 5 ~ 30 정도로 설정
//	DELAY_ACTION	= 2000	// 500 ~ 2000 정도로 설정
//	DELAY_LOGIN	= 1000	// 100 ~ 1000 정도로 설정


	//-------------------------------------------------
	// 1 Loop 당, 1 Client 의 확률 조절
	//-------------------------------------------------
	RAND_CONNECT	= 100		// 끊어진 클라이언트의 재접속 확률
	RAND_DISCONNECT	= 10		// 연결된 클라이언트의 연결끊기 확률
	RAND_CONTENTS	= 80		// 연결된 클라이언트의 컨텐츠 송신 확률



	//-------------------------------------------------
	// 액션 딜레이 설정 (밀리세컨드)
	//
	// 스레드 루프마다 딜레이가 입력 된다.
	//
	// 그러므로 스레드가 10개이면 최대 10명은 딜레이와 상관 없이 동시에 액션을 취할 수 있다.
	//-------------------------------------------------
	DELAY_ACTION 	= 1000		// 액션 딜레이 - 실제 유저와 비슷한 시뮬레이션을 위해 조절한다.

	DELAY_LOGIN	= 1000		// Connect 후 로그인 요청까지의 딜레이

	
	LOGIN_SUCCESS_DISCONNECT = 1	// 로그인 성공시 더미가 연결을 끊도록 설정 합니다.
					// 0 : 서버가 끊기를 기다림 (서버가 결과를 보내고 끊음) / 1 : 더미가 결과 받고 끊음


	RECV_SOCKET_BUFFER = 32768	// 기본 8k  소켓 수신버퍼 입니다.  16384 / 32768 / 65536

	//-------------------------------------------------
	// ID List - 텍스트 (유니코드) 파일로 AccountNo ID Nick 이 세로로 입력되어 있어야 함.
	//
	// 최대 10개 지정이 가능하며 더미클라 첫 시작시에 선택한다.
	// 각 파일마다 최대 1만개의 ID 입력 가능
	//-------------------------------------------------
	LIST_ID_0	= "ID0.txt"
	LIST_ID_1	= "ID1.txt"
	LIST_ID_2	= "ID2.txt"
	LIST_ID_3	= "ID3.txt"
	LIST_ID_4	= "ID4.txt"
	LIST_ID_5	= "ID5.txt"
	LIST_ID_6	= "ID6.txt"
	LIST_ID_7	= "ID7.txt"
	LIST_ID_8	= "ID8.txt"
	LIST_ID_9	= "ID9.txt"
	
}
